Feature: 常客积分计划

  常客积分计划是一种增强客户忠诚度的市场营销工具。在签署常客积分计划之后，客户在网店购买之后可以挣得积分。客户可以兑换积分或再次购买时获得折扣。


  Background: 我们的主角阿宝
    Given 阿宝签署了常客积分计划

  Scenario: 客户在注册时可以获赠常客积分

    客户需要明确遵守该计划以符合GDPR规定。为了激励他们加入该计划，他们会获得一些积分作为礼物。

    Given 阿宝，是一位对常客积分计划感兴趣的客户
    When 他注册项目并同意条款
    Then 他的个人账号已创建并且他收到100积分作为欢迎礼


  Scenario: 客户用一次性分期付款支付时挣得更多常客积分

    巴西客户喜欢分期付款，但这对卖方来说是一个成本（卖方必须向信用卡公司支付利息）。  我们想吸引巴西客户一次性付款购买，这样他们在这样做时可以获得积分。

    Given 阿宝签署了常客积分计划
    Given 阿宝愿意购买价值3000元的培训课程
    When 阿宝用信用卡一次性分期付款购买培训课程
    Then 阿宝挣得30个常客积分


  Scenario: 客户用多次分期付款支付时挣得更少常客积分

    Given 阿宝签署了常客积分计划
    Given 阿宝愿意购买价值3000元的培训课程
    When 阿宝用信用卡分3期付款购买培训课程
    Then 阿宝挣得5个常客积分

  Scenario: 客户用银行转账现金支付时挣得最多常客积分

    通过银行转账支付是最有利且成本最低的支付方式。这就是为什么我们想用最多的积分来奖励它。

    Given 阿宝签署了常客积分计划
    Given 阿宝愿意购买价值3000元的培训课程
    When 阿宝用银行转账现金支付购买培训课程
    Then 阿宝挣得100个常客积分



  Scenario Outline: 用分期付款购买课程挣得常客积分

    Given 阿宝签署了常客积分计划
    And 阿宝愿意购买价值<price>元的培训课程
    When 阿宝用信用卡分<number-installments>期付款购买培训课程
    Then 阿宝挣得<loyalty-points>个常客积分

    Examples: 分期次数

      | price | number-installments | loyalty |
      | 3000  | 1                   | 90      |
      | 3000  | 2                   | 60      |
      | 3000  | 3                   | 30      |
      | 3000  | 4                   | 0       |


    Examples: 常客积分与价格成比例

      | price | number-installments | loyalty |
      | 1000  | 1                   | 30      |
      | 2000  | 1                   | 60      |
      | 3000  | 1                   | 90      |


